hey_result.log
Fri Nov 11 15:32:30 +0530 2022
+--------------+-------+
| Replicas     | 1     |
+--------------+-------+
| CPU limit    | 125m  |
+--------------+-------+
| Memory limit | 125Mi |
+--------------+-------+

░██████╗░░█████╗░██╗░░░░░░█████╗░███╗░░██╗░██████╗░
██╔════╝░██╔══██╗██║░░░░░██╔══██╗████╗░██║██╔════╝░
██║░░██╗░██║░░██║██║░░░░░███████║██╔██╗██║██║░░██╗░
██║░░╚██╗██║░░██║██║░░░░░██╔══██║██║╚████║██║░░╚██╗
╚██████╔╝╚█████╔╝███████╗██║░░██║██║░╚███║╚██████╔╝
░╚═════╝░░╚════╝░╚══════╝╚═╝░░╚═╝╚═╝░░╚══╝░╚═════╝░

Summary:
  Total:	0.3440 secs
  Slowest:	0.3440 secs
  Fastest:	0.3440 secs
  Average:	0.3440 secs
  Requests/sec:	2.9067
  

Response time histogram:
  0.344 [1]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.344 [0]	|
  0.344 [0]	|
  0.344 [0]	|
[...]


Latency distribution:
  0% in 0.0000 secs
  0% in 0.0000 secs
  0% in 0.0000 secs
[...]

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.3440 secs, 0.3440 secs
  DNS-lookup:	0.0004 secs, 0.0004 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	0.3434 secs, 0.3434 secs, 0.3434 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [201]	1 responses



░░░░░██╗░█████╗░██╗░░░██╗░█████╗░
░░░░░██║██╔══██╗██║░░░██║██╔══██╗
░░░░░██║███████║╚██╗░██╔╝███████║
██╗░░██║██╔══██║░╚████╔╝░██╔══██║
╚█████╔╝██║░░██║░░╚██╔╝░░██║░░██║
░╚════╝░╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░╚═╝

Summary:
  Total:	1.5069 secs
  Slowest:	1.5069 secs
  Fastest:	1.5069 secs
  Average:	1.5069 secs
  Requests/sec:	0.6636
  

Response time histogram:
  1.507 [1]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.507 [0]	|
  1.507 [0]	|
  1.507 [0]	|
[...]


Latency distribution:
  0% in 0.0000 secs
  0% in 0.0000 secs
  0% in 0.0000 secs
[...]

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 1.5069 secs, 1.5069 secs
  DNS-lookup:	0.0001 secs, 0.0001 secs, 0.0001 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	1.5064 secs, 1.5064 secs, 1.5064 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [201]	1 responses



░░░░░██╗░█████╗░██╗░░░██╗░█████╗░░██████╗░█████╗░██████╗░██╗██████╗░████████╗
░░░░░██║██╔══██╗██║░░░██║██╔══██╗██╔════╝██╔══██╗██╔══██╗██║██╔══██╗╚══██╔══╝
░░░░░██║███████║╚██╗░██╔╝███████║╚█████╗░██║░░╚═╝██████╔╝██║██████╔╝░░░██║░░░
██╗░░██║██╔══██║░╚████╔╝░██╔══██║░╚═══██╗██║░░██╗██╔══██╗██║██╔═══╝░░░░██║░░░
╚█████╔╝██║░░██║░░╚██╔╝░░██║░░██║██████╔╝╚█████╔╝██║░░██║██║██║░░░░░░░░██║░░░
░╚════╝░╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░╚═╝╚═════╝░░╚════╝░╚═╝░░╚═╝╚═╝╚═╝░░░░░░░░╚═╝░░░

Summary:
  Total:	0.2752 secs
  Slowest:	0.2752 secs
  Fastest:	0.2752 secs
  Average:	0.2752 secs
  Requests/sec:	3.6333
  

Response time histogram:
  0.275 [1]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.275 [0]	|
  0.275 [0]	|
  0.275 [0]	|
[...]


Latency distribution:
  0% in 0.0000 secs
  0% in 0.0000 secs
  0% in 0.0000 secs
[...]

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.2752 secs, 0.2752 secs
  DNS-lookup:	0.0003 secs, 0.0003 secs, 0.0003 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	0.2745 secs, 0.2745 secs, 0.2745 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [201]	1 responses



██████╗░██╗░░░██╗████████╗██╗░░██╗░█████╗░███╗░░██╗
██╔══██╗╚██╗░██╔╝╚══██╔══╝██║░░██║██╔══██╗████╗░██║
██████╔╝░╚████╔╝░░░░██║░░░███████║██║░░██║██╔██╗██║
██╔═══╝░░░╚██╔╝░░░░░██║░░░██╔══██║██║░░██║██║╚████║
██║░░░░░░░░██║░░░░░░██║░░░██║░░██║╚█████╔╝██║░╚███║
╚═╝░░░░░░░░╚═╝░░░░░░╚═╝░░░╚═╝░░╚═╝░╚════╝░╚═╝░░╚══╝

Summary:
  Total:	0.2233 secs
  Slowest:	0.2233 secs
  Fastest:	0.2233 secs
  Average:	0.2233 secs
  Requests/sec:	4.4782
  

Response time histogram:
  0.223 [1]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.223 [0]	|
  0.223 [0]	|
  0.223 [0]	|
[...]


Latency distribution:
  0% in 0.0000 secs
  0% in 0.0000 secs
  0% in 0.0000 secs
[...]

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.2233 secs, 0.2233 secs
  DNS-lookup:	0.0004 secs, 0.0004 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0000 secs
  resp wait:	0.2226 secs, 0.2226 secs, 0.2226 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0001 secs

Status code distribution:
  [201]	1 responses



Fri Nov 11 15:32:32 +0530 2022